test/logs_soap_security/k6.log
     execution: local
        script: test_read_securityTest_soap.js
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 5m0s max duration (incl. graceful stop):
              * malformed_requests: Up to 20 looping VUs for 4m30s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)



  █ TOTAL RESULTS 

    checks_total.......................: 7780    28.801132/s
    checks_succeeded...................: 100.00% 7780 out of 7780
    checks_failed......................: 0.00%   0 out of 7780

    ✓ Received 4xx or 5xx (expected)
    ✓ No 502/503 (server stable)

    CUSTOM
    security_response_times..........................: avg=123.635033 min=101.879261 med=120.539135 max=429.465932 p(90)=138.206949 p(95)=146.458912

    HTTP
    http_req_duration................................: avg=123.63ms   min=101.87ms   med=120.53ms   max=429.46ms   p(90)=138.2ms    p(95)=146.45ms  
    http_req_failed..................................: 100.00% 3890 out of 3890
    http_reqs........................................: 3890    14.400566/s

    EXECUTION
    iteration_duration...............................: avg=1.19s      min=1.1s       med=1.22s      max=1.58s      p(90)=1.26s      p(95)=1.28s     
    iterations.......................................: 3890    14.400566/s
    vus..............................................: 1       min=1            max=20
    vus_max..........................................: 20      min=20           max=20

    NETWORK
    data_received....................................: 321 kB  1.2 kB/s
    data_sent........................................: 1.7 MB  6.1 kB/s



running (4m30.1s), 00/20 VUs, 3890 complete and 0 interrupted iterations
malformed_requests ✓ [======================================] 00/20 VUs  4m30s